cc-env/index.html
---
title: Computer Memorandum
date: 2017-01-15 18:35:16
layout: default
lang: ja
ref: cc-env
permalink: /cc-env/index.html
---
<div id="outline-container-orga1f20a1" class="outline-2">
<h2 id="orga1f20a1">計算機関連のメモ書き</h2>
<div class="outline-text-2" id="text-orga1f20a1">
<p>
自分の計算機環境を整えた時の log を気が向いた時に書いています.
自分が分かれば良いと思っているので, あまりまとまってないし整ってもいません.
さらに, 思いついた時に適当に書き散らしていますんで,
文書の形式(というか文体?)は全く揃っていません. 書きかけの文書もあります.
ですから, 無責任, 無保証ですので, この文書によって生じたいかなる
不利益, 損害についての責任も取れません, 取りません. 御容赦下さい.
</p>

<p>
<strong>現在再構成中です。</strong>
</p>
</div>
</div>
<div id="outline-container-org028efc8" class="outline-2">
<h2 id="org028efc8">このサイトができるまで。</h2>
<div class="outline-text-2" id="text-org028efc8">
<p>
このサイトは、記事を Emacs の <a href="http://orgmode.org/">Org mode</a> で書いて、
<a href="http://jekyllrb.com/">Jekyll</a> で HTML に変換しています。
</p>

<p>
<a href="http://orgmode.org/">Org mode</a> のファイルそのものに(なるべく)手を加えることなく、
それなりに一貫性を持ってコンテンツを作成するために、
幾つか <a href="http://jekyllrb.com/">Jekyll</a> のプラグインを書いています。その解説などを。
</p>
<ul class="org-ul">
<li><a href="JekyllandOrg.html">このサイトができるまで</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9b6b39a" class="outline-2">
<h2 id="org9b6b39a">Debian 関係</h2>
<div class="outline-text-2" id="text-org9b6b39a">
<p>
Debian 一般に関する話は
</p>
<ul class="org-ul">
<li>本家: 『<a href="http://www.debian.org/index.ja.html">Debian &#x2013; ユニバーサルオペレーティングシステム</a>』</li>
<li>Debian JP Project: 『<a href="http://www.debian.or.jp/">Debian JP Project</a>』</li>
<li>Debian 勉強会: 『<a href="http://tokyodebian.alioth.debian.org/">東京エリアDebian勉強会</a>』</li>
</ul>
<p>
にある文書を参考に. 特に勉強会の文書は宝の山です.
</p>
</div>
</div>
